BRBPortal_CSharp/StaticData/XMLFile1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cityofberkeley.info/RTS/ClientPortal/API">
  <soapenv:Header/>
  <soapenv:Body>
    <api:savePaymentCart>
      <savePaymentToCart>
        <cartId></cartId>
        <!--Optional:-->
        <paymentConfirmationNo>0</paymentConfirmationNo>
        <!--Optional:-->
        <paymentMethod></paymentMethod>
        <paymentReceivedAmt>0</paymentReceivedAmt>
        <isFeeOnlyPaid>false</isFeeOnlyPaid>
        <!--1 or more repetitions:-->
        <items>
          <itemId>0</itemId>
          <propertyId>1968</propertyId>
          <propertyMainStreetAddress>2336 CURTIS ST</propertyMainStreetAddress>
          <fee>0.00</fee>
          <penalties>0.00</penalties>
          <balance>0.00</balance>
        </items>
      </savePaymentToCart>
      <request>
        <!--Optional:-->
        <userId>DAVE02</userId>
        <!--Optional:-->
        <billingCode>LIUHEL</billingCode>
      </request>
    </api:savePaymentCart>
  </soapenv:Body>
</soapenv:Envelope>